namespace Common.Policies.Pollicies.Nats;

/// <summary>
/// Перечисление доставки сообщений.
/// </summary>
public enum NatsJsDeliverPolicy
{
    /// <summary>
    /// Доставить все сообщения с начала потока.
    /// Полная история сообщений.
    /// </summary>
    All = 0,
    
    /// <summary>
    /// Доставить только последнее сообщение в потоке.
    /// Только текущее состояние.  Для получения актуальных данных.
    /// </summary>
    Last = 1,
    
    /// <summary>
    /// Доставлять только новые сообщения (после создания подписки).
    /// Только будущие сообщения. Для real-time обработки без истории.
    /// </summary>
    New = 2,
    
    /// <summary>
    /// Начать доставку с указанного порядкового номера (sequence).
    /// Контролируемая позиция старта. Для продолжения с определенного места.
    /// </summary>
    ByStartSequence = 3,
    
    /// <summary>
    /// Начать доставку с сообщений, опубликованных после указанного времени.
    /// Временная точка отсчета. Для обработки данных с определенного момента.
    /// </summary>
    ByStartTime = 4,
    
    /// <summary>
    /// Доставить последнее сообщение для каждого уникального subject в потоке.
    /// Только последние значения по каждому ключу. Паттерн "ключ-значение".
    /// </summary>
    LastPerSubject = 5
}