namespace Common.Messaging.Nats.SubscribeMode;

/// <summary>
/// Перечисление доставки сообщений.
/// </summary>
public enum NatsJsSubscribeMode
{
    None  = 0,
    
    /// <summary>
    /// Сообщения доставляются в указанный субъект.
    /// <remarks>
    ///Сервер контролирует поток сообщений, и сообщения из потока автоматически распределяются между клиентами,
    /// подписавшимися на субъект.
    /// </remarks>
    /// </summary>
    Push = 1,
    
    /// <summary>
    /// Клиенты запрашивают сообщения явно у сервера в пакетах.
    /// <remarks>
    /// Клиент контролирует отправку сообщений, контроль потока, ожидающие (неподтверждённые) сообщения и балансировку нагрузки
    /// </remarks>
    /// </summary>
    Pull = 2
}